Repository: antongleb1-dev/invites
Catalog: mobile/lib/l10n/app_*.arb
Languages: hi

# tagline
source: Create beautiful invitations with AI
hi: AI की मदद से सुंदर निमंत्रण बनाएँ

source: Login
hi: लॉगिन

source: Sign Up
hi: साइन अप

source: Email
hi: ईमेल

source: Password
hi: पासवर्ड

source: Name
hi: नाम

source: Forgot Password?
hi: पासवर्ड भूल गए?

source: or continue with
hi: या इसके साथ जारी रखें

source: Continue as Guest
hi: गेस्ट के रूप में जारी रखें

source: Home
hi: होम

source: Preview
hi: प्रीव्यू

source: Tokens
hi: टोकन

source: Profile
hi: प्रोफ़ाइल

source: Create Invitation
hi: निमंत्रण बनाएँ

# promptPlaceholder
source: Describe your event: wedding, birthday, corporate...
hi: अपने इवेंट का वर्णन करें: शादी, जन्मदिन, कॉर्पोरेट...

source: Generate
hi: बनाएँ

source: Generating...
hi: बना रहे हैं...

source: Token Balance
hi: टोकन बैलेंस

source: Buy Tokens
hi: टोकन खरीदें

source: Share
hi: शेयर करें

source: Save
hi: सेव करें

source: Regenerate
hi: फिर से बनाएँ

source: My Invitations
hi: मेरे निमंत्रण

source: Settings
hi: सेटिंग्स

source: Language
hi: भाषा

source: Logout
hi: लॉगआउट

source: How it works
hi: यह कैसे काम करता है

# step1
source: Describe your event
hi: अपने इवेंट का वर्णन करें

# step1Desc
source: Tell AI about your event - wedding, birthday, party
hi: AI को अपने इवेंट के बारे में बताएँ — शादी, जन्मदिन, पार्टी

# step2
source: Generate invitation
hi: निमंत्रण जेनरेट करें

# step2Desc
source: AI creates a beautiful personalized invitation
hi: AI एक सुंदर व्यक्तिगत निमंत्रण बनाता है

# step3
source: Share with guests
hi: मेहमानों के साथ शेयर करें

# step3Desc
source: Send the link to your guests
hi: अपने मेहमानों को लिंक भेजें

# welcomeMessage
source: Hi! ✨ I'll create a premium-level online invitation for you — like from a top design studio. Tell me: 1. What's the event? Wedding, birthday, anniversary, corporate party... 2. When and where? Date, time and venue 3. What vibe suits you best? • 🖤 Minimal luxe — clean, elegant, whitespace • 💫 Editorial — like a fashion magazine cover • 🌿 Organic — soft tones, natural textures • ✨ Modern classic — tradition + modernity • 🎨 Bold — bright, unconventional, memorable You can upload photos and add a YouTube music link right away — I'll use them as the design foundation! 📸🎵
hi: नमस्ते! ✨ मैं आपके लिए प्रीमियम स्तर का ऑनलाइन निमंत्रण बनाऊँगा — जैसे किसी टॉप डिज़ाइन स्टूडियो से। बताइए: 1. कौन सा इवेंट है? शादी, जन्मदिन, सालगिरह, कॉर्पोरेट पार्टी... 2. कब और कहाँ? तारीख, समय और स्थान 3. कौन सा स्टाइल पसंद है? • 🖤 Minimal luxe — साफ़, शानदार, खुला • 💫 Editorial — फ़ैशन मैगज़ीन कवर जैसा • 🌿 Organic — सॉफ्ट टोन, प्राकृतिक टेक्सचर • ✨ Modern classic — परंपरा + आधुनिकता • 🎨 Bold — चमकदार, अलग, यादगार आप फ़ोटो अपलोड कर सकते हैं और YouTube म्यूज़िक लिंक जोड़ सकते हैं — मैं इन्हें डिज़ाइन की नींव के रूप में उपयोग करूँगा! 📸🎵

source: AI Designer
hi: AI डिज़ाइनर

# aiDesignerSubtitle
source: Create invitations with AI
hi: AI से निमंत्रण बनाएँ

# eventWedding
source: 💒 Wedding
hi: 💒 शादी

# eventBirthday
source: 🎂 Birthday
hi: 🎂 जन्मदिन

# eventCorporate
source: 🏢 Corporate
hi: 🏢 कॉर्पोरेट

# eventAnniversary
source: 🎉 Anniversary
hi: 🎉 सालगिरह

# eventNewYear
source: 🎄 New Year
hi: 🎄 नया साल

# agentClassic
source: Classic
hi: क्लासिक

source: Preview invitation
hi: निमंत्रण देखें

# generatingInvitation
source: Creating your invitation... This may take a moment.
hi: आपका निमंत्रण बना रहे हैं... थोड़ा समय लग सकता है।

# errorNotEnoughTokens
source: Not enough tokens. Please purchase more to continue.
hi: टोकन कम हैं। जारी रखने के लिए और खरीदें।

# errorGeneral
source: Something went wrong. Please try again.
hi: कुछ गलत हो गया। फिर से कोशिश करें।

source: Chat cleared
hi: चैट साफ़ हो गया

source: New Chat
hi: नया चैट

source: Saving...
hi: सेव हो रहा है...

source: Saved
hi: सेव हो गया

source: Creating...
hi: बना रहे हैं...

source: Photo from Gallery
hi: गैलरी से फ़ोटो

source: Take Photo
hi: फ़ोटो लें

# videoOption
source: Video
hi: वीडियो

# attachedFiles
source: 📎 Attached {count} file(s)
hi: 📎 {count} फ़ाइल(ें) अटैच

source: Invitation
hi: निमंत्रण

# loadedForEditing
source: Loaded "{title}" for editing. You can continue making changes — just describe what you want to update.
hi: «{title}» एडिटिंग के लिए लोड हो गया। आप बदलाव जारी रख सकते हैं — बस बताएँ क्या बदलना है।

# couldNotLoadInvitation
source: Could not load invitation. Please try again.
hi: निमंत्रण लोड नहीं हो सका। फिर से कोशिश करें।

# errorAuth
source: Please login to generate invitations.
hi: कृपया निमंत्रण बनाने के लिए लॉगिन करें।

# errorEditLimit
source: You have reached your edit limit. Please purchase a package to continue.
hi: आपकी एडिट सीमा पूरी हो गई। जारी रखने के लिए पैकेज खरीदें।

# errorForbidden
source: Access denied. Please check your account.
hi: एक्सेस अस्वीकृत। कृपया अपना अकाउंट जाँचें।

# errorTimeout
source: Request timed out. AI generation can take up to 2 minutes — please try again.
hi: टाइमआउट। AI जेनरेशन में 2 मिनट तक लग सकते हैं — फिर से कोशिश करें।

source: Loading...
hi: लोड हो रहा है...

source: Error
hi: त्रुटि

source: Invitation not found
hi: निमंत्रण नहीं मिला

source: Go Back
hi: वापस जाएँ

source: Untitled
hi: बिना शीर्षक

source: Delete
hi: हटाएँ

# tabInfo
source: Info
hi: जानकारी

# tabWishes
source: Wishes
hi: शुभकामनाएँ

# tabWishlist
source: Wishlist
hi: उपहार सूची

source: Published
hi: प्रकाशित

source: Draft
hi: ड्राफ़्ट

# statusLiveDescription
source: Your invitation is live and accessible
hi: आपका निमंत्रण सक्रिय और सुलभ है

# statusDraftDescription
source: Publish to share with guests
hi: मेहमानों के साथ शेयर करने के लिए प्रकाशित करें

source: Invitation Link
hi: निमंत्रण लिंक

source: My Invitation
hi: मेरा निमंत्रण

source: Link copied!
hi: लिंक कॉपी हो गया!

# publishToActivate
source: Publish your invitation to activate the link
hi: लिंक सक्रिय करने के लिए निमंत्रण प्रकाशित करें

# aiPackageLabel
source: AI Package: {name}
hi: AI पैकेज: {name}

source: No AI Package
hi: कोई AI पैकेज नहीं

# editsRemaining
source: {count} edits remaining
hi: {count} एडिट बाकी

# purchaseForEdits
source: Purchase a package for AI edits
hi: AI एडिट के लिए पैकेज खरीदें

source: Buy
hi: खरीदें

# titleLabel
source: Title
hi: शीर्षक

source: URL slug
hi: URL लिंक

source: Save Changes
hi: बदलाव सेव करें

# savedSuccess
source: Saved!
hi: सेव हो गया!

# errorWithMessage
source: Error: {message}
hi: त्रुटि: {message}

# createdDate
source: Created
hi: बनाया गया

source: Last modified
hi: अंतिम बदलाव

# notAvailable
source: N/A
hi: उपलब्ध नहीं

source: Edit Invitation
hi: निमंत्रण एडिट करें

source: View Invitation
hi: निमंत्रण देखें

# publishButton
source: Publish
hi: प्रकाशित करें

# noRsvpYet
source: No RSVP responses yet
hi: अभी कोई RSVP जवाब नहीं

# rsvpEmptyDescription
source: Guests will appear here when they confirm attendance
hi: मेहमान यहाँ दिखेंगे जब वे उपस्थिति की पुष्टि करेंगे

# unknownGuest
source: Unknown
hi: अज्ञात

# guestCount
source: {count} guests
hi: {count} मेहमान

source: Attending
hi: आएँगे

# attendingPlusOne
source: Attending +1
hi: आएँगे +1

source: Attending with spouse
hi: साथी के साथ आएँगे

source: Not attending
hi: नहीं आएँगे

source: No wishes yet
hi: अभी कोई शुभकामनाएँ नहीं

# wishesEmptyDescription
source: Guest wishes will appear here
hi: मेहमानों की शुभकामनाएँ यहाँ दिखेंगी

# guestLabel
source: Guest
hi: मेहमान

# approvedStatus
source: Approved
hi: स्वीकृत

# pendingStatus
source: Pending
hi: लंबित

source: Reject
hi: अस्वीकार

source: Approve
hi: स्वीकार

source: No gifts yet
hi: अभी कोई उपहार नहीं

# giftsEmptyDescription
source: Add gifts to your wishlist on the website
hi: वेबसाइट पर अपनी उपहार सूची में उपहार जोड़ें

# giftLabel
source: Gift
hi: उपहार

source: Reserved
hi: आरक्षित

# reservedByLabel
source: by {name}
hi: {name} द्वारा

source: Open link
hi: लिंक खोलें

source: Invitation published!
hi: निमंत्रण प्रकाशित हो गया!

source: Error creating payment
hi: भुगतान बनाने में त्रुटि

source: Delete Invitation
hi: निमंत्रण हटाएँ

# deleteConfirmation
source: Are you sure you want to delete this invitation? This action cannot be undone.
hi: क्या आप वाकई इस निमंत्रण को हटाना चाहते हैं? यह कार्रवाई पूर्ववत नहीं की जा सकती।

source: Cancel
hi: रद्द करें

source: Invitation deleted
hi: निमंत्रण हटा दिया गया

source: Failed to delete
hi: हटाने में विफल

# guestUser
source: Guest
hi: गेस्ट

source: No invitations yet
hi: अभी कोई निमंत्रण नहीं

# createFirstInvitation
source: Create your first AI invitation!
hi: अपना पहला AI निमंत्रण बनाएँ!

source: Error loading invitations
hi: निमंत्रण लोड करने में त्रुटि

# choosePackageSubtitle
source: Choose a package to create AI invitations
hi: AI निमंत्रण बनाने के लिए पैकेज चुनें

# aiPackagesTitle
source: AI Packages
hi: AI पैकेज

source: Need more edits?
hi: और एडिट चाहिए?

source: How packages work
hi: पैकेज कैसे काम करते हैं

# packagesStep1
source: Choose a package based on your needs
hi: अपनी ज़रूरत के अनुसार पैकेज चुनें

# packagesStep2
source: Each AI edit refines your invitation design
hi: हर एडिट आपके निमंत्रण को बेहतर बनाती है

# packagesStep3
source: Your first message is free — try it now!
hi: पहला संदेश मुफ़्त है — अभी आज़माएँ!

# createInvitationFirst
source: Please create an invitation first, then purchase a package.
hi: पहले निमंत्रण बनाएँ, फिर पैकेज खरीदें।

source: POPULAR
hi: लोकप्रिय

source: Add
hi: जोड़ें

# editsUnit
source: edits
hi: एडिट

# mobileView
source: Mobile
hi: मोबाइल

# tabletView
source: Tablet
hi: टैबलेट

# desktopView
source: Desktop
hi: डेस्कटॉप

# editButton
source: Edit
hi: एडिट

# shareSubject
source: My Invitation — Invites AI
hi: मेरा निमंत्रण — Invites AI

source: No invitation yet
hi: अभी कोई निमंत्रण नहीं

# goBackToChat
source: Go back to chat and describe your event to generate an invitation.
hi: चैट पर वापस जाएँ और निमंत्रण बनाने के लिए इवेंट का वर्णन करें।

# purchaseSuccess
source: Purchase successful!
hi: खरीद सफल!

# purchasePending
source: Purchase is being processed...
hi: खरीद प्रक्रिया में है...

# purchaseError
source: Purchase failed. Please try again.
hi: खरीद विफल। फिर से कोशिश करें।

source: Restore Purchases
hi: खरीदारी पुनर्स्थापित करें

source: Restoring purchases...
hi: खरीदारी पुनर्स्थापित हो रही है...

# purchasesRestored
source: Purchases restored successfully!
hi: खरीदारी सफलतापूर्वक पुनर्स्थापित!

source: No purchases to restore.
hi: पुनर्स्थापित करने के लिए कोई खरीदारी नहीं।

# priceNotAvailable
source: Price loading...
hi: कीमत लोड हो रही है...
